Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1025SG00144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="DIB">
         <name>DIB_NS</name>
         <baseAddress>0xE002EFB0</baseAddress>
      </peripheral>
      <peripheral>
         <name>DMA0</name>
         <version>036391b0</version>
         <description>Direct Memory Access Controller</description>
         <groupName>DMA</groupName>
         <prependToName>DMA_</prependToName>
         <baseAddress>0x44802000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2D0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMA0_PRI0</name>
            <description>DMA 0 Priority 0 Interrupt</description>
            <value>33</value>
         </interrupt>
         <interrupt>
            <name>DMA0_PRI1</name>
            <description>DMA 0 Priority 1 Interrupt</description>
            <value>34</value>
         </interrupt>
         <interrupt>
            <name>DMA0_PRI2</name>
            <description>DMA 0 Priority 2 Interrupt</description>
            <value>35</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>DMA CONTROL A REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>DMA Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>DMA CONTROL B REGISTER</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>QOS1</name>
                     <description>Priority Group 1 Quality Of Service Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS1Select</name>
                        <enumeratedValue>
                           <name>LEVEL_0</name>
                           <description>QoS level is 0 (lowest)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_1</name>
                           <description>QoS level is 1 (lower)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2</name>
                           <description>QoS level is 2 (medium)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_3</name>
                           <description>QoS level is 3 (high)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QOS2</name>
                     <description>Priority Group 2 Quality Of Service Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS2Select</name>
                        <enumeratedValue>
                           <name>LEVEL_0</name>
                           <description>QoS level is 0 (lowest)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_1</name>
                           <description>QoS level is 1 (lower)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2</name>
                           <description>QoS level is 2 (medium)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_3</name>
                           <description>QoS level is 3 (high)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QOS3</name>
                     <description>Priority Group 3 Quality Of Service Control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>QOS3Select</name>
                        <enumeratedValue>
                           <name>LEVEL_0</name>
                           <description>QoS level is 0 (lowest)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_1</name>
                           <description>QoS level is 1 (lower)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_2</name>
                           <description>QoS level is 2 (medium)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LEVEL_3</name>
                           <description>QoS level is 3 (high)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>QOS4</name>
                     <description>Priority Group 4 Quality Of Service Control</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>DEBUG CONTROL REGISTER</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCPOLYA</name>
               <description>DMA CRC POLYNOMIAL A REGISTER</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>POLYA</name>
                     <description>CRC Polynomial Coefficients A Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCPOLYB</name>
               <description>DMA CRC POLYNOMIAL B REGISTER</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>POLYB</name>
                     <description>CRC Polynomial Coefficients B Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTAT3</name>
               <description>DMA INTERRUPT PRIORITY 3 STATUS REGISTER</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH0</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH7</name>
                     <description>DMA Channel active interrupt at priority 3</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTAT2</name>
               <description>DMA INTERRUPT PRIORITY 2 STATUS REGISTER</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH0</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH7</name>
                     <description>DMA Channel active interrupt at priority 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTAT1</name>
               <description>DMA INTERRUPT PRIORITY 1 STATUS REGISTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CH0</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH1</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH2</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH3</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH4</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH5</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH6</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CH7</name>
                     <description>DMA Channel active interrupt at priority 1</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>8</dim>
               <dimIncrement>0x50</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description/>
               <addressOffset>0x50</addressOffset>
               <register>
                  <name>CHCTRLA</name>
                  <description>CHANNEL CONTROL REGISTER A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ENABLE</name>
                        <description>Channel Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LLEN</name>
                        <description>Linked List Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SWFRC</name>
                        <description>Software Forced Trigger</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run In Standby</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
