Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1025SG00144.svd
            <register>
               <name>CIDR3</name>
               <description>DWT Component Identification Register 3</description>
               <addressOffset>0xFFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x000000B1</resetValue>
               <fields>
                  <field>
                     <name>PRMBL_3</name>
                     <description>CoreSight component identification preamble</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>EBI</name>
         <version>035911a0</version>
         <description>External Bus Interface</description>
         <baseAddress>0x4502C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>4</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>CS_X[%s]</name>
               <description/>
               <addressOffset>0x00</addressOffset>
               <register>
                  <name>SMC_SETUP</name>
                  <description>SMC Setup Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x01010101</resetValue>
                  <fields>
                     <field>
                        <name>NWE_SETUP</name>
                        <description>NWE Setup Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_SETUP</name>
                        <description>NCS Setup Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NRD_SETUP</name>
                        <description>NRD Setup Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_SETUP</name>
                        <description>NCS Setup Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SMC_PULSE</name>
                  <description>SMC Pulse Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x01010101</resetValue>
                  <fields>
                     <field>
                        <name>NWE_PULSE</name>
                        <description>NWE Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_PULSE</name>
                        <description>NCS Pulse Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NRD_PULSE</name>
                        <description>NRD Pulse Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_PULSE</name>
                        <description>NCS Pulse Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SMC_CYCLE</name>
                  <description>SMC Cycle Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00030003</resetValue>
                  <fields>
                     <field>
                        <name>NWE_CYCLE</name>
                        <description>Total Write Cycle Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>NRD_CYCLE</name>
                        <description>Total Read Cycle Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SMC_MODE</name>
                  <description>SMC Mode Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <resetValue>0x10001003</resetValue>
                  <fields>
                     <field>
                        <name>READ_MODE</name>
                        <description>Read Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRITE_MODE</name>
                        <description>Write Mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EXNW_MODE</name>
                        <description>NWAIT Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EXNW_MODESelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READY</name>
                              <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BAT</name>
                        <description>Byte Access Type</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>BATSelect</name>
                           <enumeratedValue>
                              <name>BYTE_SELECT</name>
                              <description>Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTE_WRITE</name>
                              <description>Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DBW</name>
                        <description>Data Bus Width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DBWSelect</name>
                           <enumeratedValue>
                              <name>_8_BIT</name>
                              <description>8-bit Data Bus</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16_BIT</name>
                              <description>16-bit Data Bus</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TDF_CYCLES</name>
                        <description>Data Float Time</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TDF_MODE</name>
                        <description>TDF Optimization</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PMEN</name>
                        <description>Page Mode Enabled</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PS</name>
                        <description>Page Size</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PSSelect</name>
                           <enumeratedValue>
                              <name>_4_BYTE</name>
                              <description>4-byte page</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_8_BYTE</name>
                              <description>8-byte page</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16_BYTE</name>
                              <description>16-byte page</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_32_BYTE</name>
                              <description>32-byte page</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>SMC_WPMR</name>
               <description>SMC Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x534D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMC_WPSR</name>
               <description>SMC Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
