Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1025SG00144.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="ICB">
         <name>ICB_NS</name>
         <baseAddress>0xE002E000</baseAddress>
      </peripheral>
      <peripheral>
         <name>IDAU</name>
         <version>042503a0</version>
         <description>Implementation Defined Attribution Unit</description>
         <baseAddress>0x4480C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x1180</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMD</name>
                     <description>Command Register</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Module Enable</description>
                           <value>0xA501</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Module Disable</description>
                           <value>0xA502</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WLCK</name>
                           <description>Write Lock</description>
                           <value>0xA503</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>Status A</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WLCK</name>
                     <description>Write Lock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NBRG</name>
                     <description>Number Of IDAU Regions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSB</name>
               <description>Status B</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>24</dim>
               <dimIncrement>0x10</dimIncrement>
               <name>REGIONS[%s]</name>
               <description/>
               <addressOffset>0x1000</addressOffset>
               <register>
                  <name>RCTRL_BLOCK_MODE</name>
                  <description>Region Control</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ARG</name>
                        <description>Command Argument (Block ID)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>CLRNONSEC</name>
                              <description>Clear IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=0)</description>
                              <value>0x5A</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SETNONSEC</name>
                              <description>Set IDAU region x Non-Secure State of block ARG (RSTATUSB[x].NONSEC[ARG]=1)</description>
                              <value>0x5B</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RCTRL_WATERMARK_MODE</name>
                  <description>Region Control</description>
                  <alternateRegister>RCTRL_BLOCK_MODE</alternateRegister>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ARG</name>
                        <description>Command Argument (Watermark)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                        <enumeratedValues>
                           <name>CMDSelect</name>
                           <enumeratedValue>
                              <name>WRSZ</name>
                              <description>Write IDAU region x Size (RSTATUSB[x].SIZE=ARG)</description>
                              <value>0x5C</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RSTATUSA</name>
                  <description>Region Status A</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>TYPE</name>
                        <description>IDAU Region Type</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>TYPESelect</name>
                           <enumeratedValue>
                              <name>INVALID</name>
                              <description>Region is invalid</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SEC</name>
                              <description>Region is secure</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NONSEC</name>
                              <description>Region is non secure</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NONSEC_W</name>
                              <description>Region is non secure, the associated register group implements a watermark configuration</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SECnNONSEC_B</name>
                              <description>Region is either secure or non-secure, the associated register group implements a block configuration</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SECnNONSEC_L</name>
                              <description>Region is either secure or non-secure, configuration is linked to another IDAU region configuration bit (the linked configuration bit identification info is readable from the RSTATUSC register inside the same register group)</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NSC_W</name>
                              <description>Region is non-secure callable, the associated register group implements a watermark configuration</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EXEMPT_B</name>
                              <description>Region is exempt from security, the associated register group implements a block configuration</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>GRAN</name>
                        <description>Region Granularity</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                        <enumeratedValues>
                           <name>GRANSelect</name>
                           <enumeratedValue>
                              <name>GRAN_NA</name>
                              <description>Not Applicable</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_32B</name>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_64B</name>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_128B</name>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_256B</name>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_512B</name>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_1KB</name>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_2KB</name>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_4KB</name>
                              <value>0xC</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_8KB</name>
                              <value>0xD</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_16KB</name>
                              <value>0xE</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_32KB</name>
                              <value>0xF</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_64KB</name>
                              <value>0x10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_128KB</name>
                              <value>0x11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_256KB</name>
                              <value>0x12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_512KB</name>
                              <value>0x13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_1MB</name>
                              <value>0x14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_2MB</name>
                              <value>0x15</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_4MB</name>
                              <value>0x16</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_8MB</name>
                              <value>0x17</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_16MB</name>
                              <value>0x18</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_32MB</name>
                              <value>0x19</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_64MB</name>
                              <value>0x1A</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_128MB</name>
                              <value>0x1B</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_256MB</name>
                              <value>0x1C</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_512MB</name>
                              <value>0x1D</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_1GB</name>
                              <value>0x1E</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_2GB</name>
                              <value>0x1F</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>GRAN_4GB</name>
                              <value>0x20</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MAXSZ</name>
                        <description>Command Argument Maximum Size</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RSTATUSB_BLOCK_MODE</name>
                  <description>Region Status B</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NONSEC</name>
                        <description>Block Based Region Non-Secure State</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RSTATUSB_WATERMARK_MODE</name>
                  <description>Region Status B</description>
                  <alternateRegister>RSTATUSB_BLOCK_MODE</alternateRegister>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SIZE</name>
                        <description>Watermark Based Region Size in Bytes</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RSTATUSC_BLOCK_MODE</name>
                  <description>Region Status C</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CST</name>
                        <description>Constant Block Configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RSTATUSC_LINK_MODE</name>
                  <description>Region Status C</description>
                  <alternateRegister>RSTATUSC_BLOCK_MODE</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>RGN</name>
                        <description>Linked IDAU Region ID</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BLK</name>
                        <description>Linked IDAU Region Block ID</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
