Ac6Embedded/svd-microchip/PIC32CK_SG/PIC32CK1025SG00144.svd
            <register>
               <name>HC2R</name>
               <description>Host Control 2</description>
               <addressOffset>0x3E</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ASINTEN</name>
                     <description>Asynchronous Interrupt Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASINTENSelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PVALEN</name>
                     <description>Preset Value Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PVALENSelect</name>
                        <enumeratedValue>
                           <name>HOST</name>
                           <description>SDCLK and Driver Strength are controlled by Host Controller</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO</name>
                           <description>Automatic Selection by Preset Value is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CA0R</name>
               <description>Capabilities 0</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x27E8008C</resetValue>
               <fields>
                  <field>
                     <name>TEOCLKF</name>
                     <description>Timeout Clock Frequency</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>TEOCLKFSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEOCLKU</name>
                     <description>Timeout Clock Unit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TEOCLKUSelect</name>
                        <enumeratedValue>
                           <name>KHZ</name>
                           <description>KHz</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MHZ</name>
                           <description>MHz</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BASECLKF</name>
                     <description>Base Clock Frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>BASECLKFSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXBLKL</name>
                     <description>Max Block Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>MAXBLKLSelect</name>
                        <enumeratedValue>
                           <name>512</name>
                           <description>512 bytes</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1024</name>
                           <description>1024 bytes</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2048</name>
                           <description>2048 bytes</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADMA2SUP</name>
                     <description>ADMA2 Support</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ADMA2SUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>ADMA2 not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>ADMA2 Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HSSUP</name>
                     <description>High Speed Support</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>HSSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>High Speed not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>High Speed Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SDMASUP</name>
                     <description>SDMA Support</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SDMASUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>SDMA not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SDMA Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRSUP</name>
                     <description>Suspend/Resume Support</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Suspend/Resume not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Suspend/Resume Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V33VSUP</name>
                     <description>Voltage Support 3.3V</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>V33VSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>3.3V Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>3.3V Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>V30VSUP</name>
                     <description>Voltage Support 3.0V</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>V30VSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>3.0V Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>3.0V Supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ASINTSUP</name>
                     <description>Asynchronous Interrupt Support</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ASINTSUPSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Asynchronous Interrupt not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Asynchronous Interrupt supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLTYPE</name>
                     <description>Slot Type</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SLTYPESelect</name>
                        <enumeratedValue>
                           <name>REMOVABLE</name>
                           <description>Removable Card Slot</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMBEDDED</name>
                           <description>Embedded Slot for One Device</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CA1R</name>
               <description>Capabilities 1</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00010070</resetValue>
               <fields>
                  <field>
                     <name>CLKMULT</name>
                     <description>Clock Multiplier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>CLKMULTSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Clock Multiplier is Not Supported</description>
                           <value>0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCCAR</name>
               <description>Maximum Current Capabilities</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MAXCUR33V</name>
                     <description>Maximum Current for 3.3V</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>MAXCUR33VSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4MA</name>
                           <description>4mA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MA</name>
                           <description>8mA</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12MA</name>
                           <description>12mA</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MAXCUR30V</name>
                     <description>Maximum Current for 3.0V</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>MAXCUR30VSelect</name>
                        <enumeratedValue>
                           <name>OTHER</name>
                           <description>Get information via another method</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4MA</name>
                           <description>4mA</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8MA</name>
                           <description>8mA</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12MA</name>
                           <description>12mA</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FERACES</name>
               <description>Force Event for Auto CMD Error Status</description>
               <addressOffset>0x50</addressOffset>
               <size>16</size>
               <access>write-only</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ACMD12NE</name>
                     <description>Force Event for Auto CMD12 Not Executed</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMD12NESelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDTEO</name>
                     <description>Force Event for Auto CMD Timeout Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDTEOSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDCRC</name>
                     <description>Force Event for Auto CMD CRC Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDCRCSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDEND</name>
                     <description>Force Event for Auto CMD End Bit Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDENDSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACMDIDX</name>
                     <description>Force Event for Auto CMD Index Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ACMDIDXSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMDNI</name>
                     <description>Force Event for Command Not Issued By Auto CMD12 Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CMDNISelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>No Interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Interrupt is generated</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
